{
  "projects": [
    {
      "name": "Sabiadicto",
      "type": "Social Media / Content Project",
      "duration": null,
      "description_technical": "Sabiadicto es una cuenta de Instagram centrada en la divulgación de datos curiosos en formato de pequeñas píldoras de contenido. El proyecto se basa en la creación y publicación constante de piezas breves optimizadas para el consumo rápido en redes sociales, así como en el análisis de métricas, adaptación al algoritmo y optimización del formato para maximizar alcance e interacción.",
      "why_project": "El proyecto nació como un experimento personal y con el tiempo se ha convertido en algo más sólido. Fue creado con el objetivo de aprender sobre redes sociales, marketing digital y creación de comunidad, desarrollando habilidades como la comunicación clara de ideas, la constancia, el análisis de resultados y la adaptación continua. El objetivo a largo plazo es alcanzar los 100.000 seguidores."
    },
    {
      "name": "NearU",
      "type": "Mobile & Web Application",
      "duration": "1 year",
      "technologies": ["Flutter", "TypeScript", "PostgreSQL"],
      "description_technical": "NearU es una aplicación diseñada para encontrar planes cercanos adaptados a cada usuario. El proyecto incluye el desarrollo de aplicaciones móviles para iOS y Android, desarrollo web, creación de APIs, despliegue y gestión de servidores en la nube y diseño de bases de datos. Se trata de un desarrollo full-producto abordado de principio a fin durante un año.",
      "why_project": "NearU fue creado con el objetivo de construir un producto completo y real. A través de este proyecto he trabajado no solo en el desarrollo técnico, sino también en áreas como empresa, startups, redes y marketing, adquiriendo una visión global del producto. Ha sido un proceso continuo de aprendizaje, experimentación e iteración para transformar una idea en una solución funcional."
    },
    {
      "name": "Minishell",
      "type": "Systems Programming",
      "duration": null,
      "technologies": ["C", "Unix"],
      "description_technical": "Minishell es una implementación de una shell de Unix desarrollada en C como parte del currículo de 42 Madrid. El proyecto recrea funcionalidades básicas de una terminal tipo Bash, incluyendo ejecución de comandos, manejo de procesos, pipes, redirecciones, variables de entorno y señales, utilizando llamadas al sistema de bajo nivel.",
      "why_project": "Este proyecto fue realizado para profundizar en programación de sistemas y entender cómo funciona internamente una terminal. Permitió trabajar intensamente con C, comprender la gestión de procesos y la interacción directa con el sistema operativo, reforzando conocimientos de bajo nivel y control del entorno Unix."
    },
    {
      "name": "MiniRT",
      "type": "Graphics / Ray Tracing Engine",
      "duration": null,
      "technologies": ["C"],
      "description_technical": "MiniRT es un motor básico de ray tracing implementado desde cero en C como parte del programa de 42. El proyecto genera imágenes tridimensionales simulando la interacción de rayos de luz con objetos geométricos, luces y una cámara, aplicando cálculos de intersecciones, modelos de iluminación y renderizado de escenas definidas por archivos.",
      "why_project": "El objetivo de MiniRT fue profundizar en gráficos por computadora y programación de bajo nivel. El proyecto permitió aplicar matemáticas y álgebra vectorial para comprender cómo se construye un motor de renderizado desde sus fundamentos, conectando teoría y resultados visuales reales."
    },
    {
      "name": "Fractol",
      "type": "Graphics / Mathematics",
      "duration": null,
      "technologies": ["C", "MiniLibX"],
      "description_technical": "Fractol es una aplicación en C que genera y visualiza fractales matemáticos como Mandelbrot y Julia utilizando una biblioteca gráfica ligera. El proyecto trabaja con números complejos, iteraciones matemáticas y renderizado pixel a pixel, incluyendo interacción en tiempo real mediante zoom, desplazamiento y control de colores.",
      "why_project": "Este proyecto se realizó para profundizar en matemáticas aplicadas y gráficos por computadora. Fractol permitió combinar cálculo matemático, optimización y visualización interactiva, reforzando la comprensión de cómo estructuras matemáticas complejas pueden representarse visualmente desde código de bajo nivel."
    }
  ]
}
